{
	"link": "http://media.dawahnigeria.com/highlight/published/Shaykh%20Muhammed%20Bin%20Uthman%20/Test/Calling%20Allah%20With%20His%20Attributes_%2803%3B54%29_Shaykh%20Muhammad%20Bn%20Uthman_dawahnigeria.com.mp3",
	"transcript": "You can hardly hear something outside this compound, isn’t it? But what about Allah? Allah hears what is said, what is not said, even what is in your heart. So innahu huwa-S-semi’u, not only that, and ‘Aleem. Allah is All-Hearing, All-Knowing. All-Knowing. He knows every single secret in the heart of somebody concealing. Or concealing. So, Allah answered him. Because He is hearing, He heard him. Because He knew what was happening in the situation, He’s ‘Aleem. So Allah answered him. That is why, you see if you want to call Allah, call him by his beautiful names. He says waliAllahi-l-asmaahulhusna fad’hu hubiha. To Allah belongs beautiful names, so call him by his beautiful names. And in the process, there is the principle: don’t call Allah by any name that does not translate to your need. Our great scholar, As-sheikh ibn Uthaymeen, may Allah have mercy on him, in his book, in his scholarly book, Al-qahidul mutlah says likulli du’a maa yunaasibuhu minalasmaa. A good principle. If you want to call Allah’s name, there is a golden principle that says likulli du’ain maa yunaasibuhu minalasmaa. Meaning: each and every supplication to Allah, there is a name that is concomitant, if you like it, to that name. Yeah, for example, you want knowledge, you say Ya ‘Aleem ‘alimnee. You want knowledge, so you say Ya ‘Aleem, isn’t it, the All-Knowing, ‘alimnee, isn’t it? You want to, you want ar-rizq, what do you say? Ya Razzaq, OK. You want rahmah, what do you say? [Audience answer]. Don’t say Ya shadeedal hiqoob irhamni. No, that … his name … your need. OK, do you want hazabal ukhra? OK. The principle is very important, please hear the principle well likulli du’a maa yunaasibuhu minalasmaa, likulli du’ain maa yunaasibuhu minalasmaa, to each and every need and supplication, there is a name of Allah that is relevant to it. OK, innahu huwa-S-semi’u-l-‘aleem. Next ayah…"
}
